[
  "hola",
  "buenos",
  "dias",
  "hey",
  "como",
  "estas",
  "que",
  "tal",
  "buenas",
  "tardes",
  "noches",
  "todo",
  "onda",
  "gusto",
  "saludarte",
  "bien",
  "te",
  "va",
  "hay",
  "de",
  "nuevo",
  "hoy",
  "pasa",
  "saludos",
  "andas",
  "verte",
  "esta",
  "en",
  "el",
  "dia",
  "tu",
  "la",
  "vida",
  "ha",
  "ido",
  "por",
  "ahi",
  "encuentras",
  "aqui",
  "novedades",
  "tienes",
  "yendo",
  "orden",
  "contigo",
  "hasta",
  "luego",
  "nos",
  "vemos",
  "pronto",
  "adios",
  "gracias",
  "ayuda",
  "hablamos",
  "chao",
  "proxima",
  "cuidate",
  "veo",
  "bueno",
  "me",
  "voy",
  "puedes",
  "despedirte",
  "fue",
  "un",
  "placer",
  "otro",
  "momento",
  "descanses",
  "tiempo",
  "tengo",
  "ir",
  "tengas",
  "buen",
  "retiro",
  "agradezco",
  "mucho",
  "es",
  "hora",
  "irme",
  "estes",
  "amigo",
  "ya",
  "descanso",
  "a",
  "descansar",
  "proximo",
  "encuentro",
  "vuelvo",
  "estar",
  "vaya",
  "vista",
  "manana",
  "otra",
  "ocasion",
  "despido",
  "despues",
  "quiero",
  "aprender",
  "python",
  "ensenar",
  "usar",
  "hago",
  "programa",
  "muestrame",
  "ejemplo",
  "basico",
  "oye",
  "sumo",
  "dos",
  "numeros",
  "bucle",
  "explicame",
  "una",
  "funcion",
  "creo",
  "archivo",
  "explicarme",
  "lista",
  "bro",
  "manejo",
  "errores",
  "librerias",
  "recomiendas",
  "ensename",
  "instalar",
  "libreria",
  "sobre",
  "pandas",
  "mostrarme",
  "usando",
  "empiezo",
  "con",
  "django",
  "puedo",
  "hacer",
  "ayudarme",
  "problema",
  "mi",
  "codigo",
  "escribo",
  "conecto",
  "base",
  "datos",
  "clase",
  "para",
  "aplicaciones",
  "web",
  "ayudame",
  "loops",
  "anidados",
  "decorador",
  "interactivo",
  "ayudas",
  "expresiones",
  "regulares",
  "graficos",
  "automatizar",
  "tareas",
  "sirve",
  "lenguaje",
  "dificil",
  "quien",
  "variable",
  "gratuito",
  "ide",
  "son",
  "las",
  "bibliotecas",
  "modulo",
  "se",
  "declara",
  "diccionario",
  "excepciones",
  "compilado",
  "o",
  "interpretado",
  "string",
  "comentan",
  "lineas",
  "objeto",
  "flask",
  "numpy",
  "paquete",
  "pip",
  "tupla",
  "crea",
  "conjunto",
  "py",
  "pyc",
  "ejecutar",
  "script",
  "interprete",
  "soporta",
  "programacion",
  "orientada",
  "objetos",
  "comprension",
  "recursion",
  "case-sensitive",
  "iterador",
  "generador",
  "breakpoint",
  "multilinea",
  "indentacion",
  "'print'",
  "'input'",
  "manejar",
  "archivos",
  "zen",
  "programar",
  "lenguajes",
  "existen",
  "necesito",
  "empezar",
  "algoritmo",
  "error",
  "sintaxis",
  "significa",
  "depuracion",
  "framework",
  "condicional",
  "fuente",
  "funcional",
  "array",
  "enlazada",
  "compilador",
  "repositorio",
  "control",
  "versiones",
  "git",
  "commit",
  "rama",
  "merge",
  "html",
  "css",
  "javascript",
  "backend",
  "frontend",
  "api",
  "sql",
  "nosql",
  "servidor",
  "prueba",
  "unitaria",
  "ciclo",
  "del",
  "software",
  "red",
  "neuronal",
  "inteligencia",
  "artificial",
  "aprendizaje",
  "automatico",
  "entorno",
  "desarrollo",
  "cuales",
  "supervisado",
  "no",
  "refuerzo",
  "procesamiento",
  "natural",
  "vision",
  "computadora",
  "modelo",
  "chatbot",
  "asistente",
  "virtual",
  "reconocimiento",
  "voz",
  "analisis",
  "sentimientos",
  "generativo",
  "gan",
  "clustering",
  "transferencia",
  "estilo",
  "sistema",
  "experto",
  "robotica",
  "agente",
  "inteligente",
  "etica",
  "los",
  "entrenamiento",
  "sobreajuste",
  "subestimacion",
  "regresion",
  "clasificacion",
  "predictivo",
  "computacion",
  "cognitiva",
  "automatizacion",
  "procesos",
  "mineria",
  "fuerte",
  "debil",
  "costo",
  "facial",
  "sesgo",
  "algoritmico",
  "transparencia",
  "ia",
  "preentrenado",
  "profundo",
  "secuencial",
  "hiperparametro",
  "distribuida",
  "grafo",
  "conocimiento",
  "optico",
  "caracteres",
  "enjambre",
  "regularizacion",
  "real",
  "aumentada",
  "sintetico",
  "usa",
  "editor",
  "texto",
  "instalo",
  "si",
  "funciona",
  "ejecuto",
  "terminal",
  "tener",
  "listas",
  "dentro",
  "accedo",
  "elemento",
  "rango",
  "detengo",
  "parametro",
  "retorno",
  "valor",
  "'w'",
  "open",
  "excepcion",
  "eliminar",
  "cargo",
  "matplotlib",
  "donde",
  "encuentra",
  "guatemala",
  "cual",
  "capital",
  "moneda",
  "idioma",
  "habla",
  "ave",
  "nacional",
  "nombre",
  "fiambre",
  "cuando",
  "celebra",
  "independencia",
  "popol",
  "vuh",
  "huipil",
  "sitio",
  "arqueologico",
  "mas",
  "famoso",
  "marimba",
  "rincon",
  "cafe",
  "semana",
  "santa",
  "lago",
  "atitlan",
  "cuantos",
  "departamentos",
  "tiene",
  "ruinas",
  "quirigua",
  "miguel",
  "angel",
  "asturias",
  "barriletes",
  "gigantes",
  "comida",
  "tipica",
  "monumento",
  "tecun",
  "uman",
  "antigua",
  "jade",
  "cultura",
  "guatemalteca",
  "rabinal",
  "achi",
  "volcanes",
  "paabanc",
  "cacao",
  "mayas",
  "chichicastenango",
  "museo",
  "ixchel",
  "tejidos",
  "guatemaltecos",
  "parque",
  "tikal",
  "representa",
  "bandera",
  "palo",
  "volador",
  "carnaval",
  "mazatenango",
  "festival",
  "santiago",
  "zona",
  "arqueologica",
  "yaxha",
  "chiles",
  "rellenos",
  "ejercito",
  "rio",
  "dulce",
  "palacio",
  "calendario",
  "maya",
  "musica",
  "difuntos",
  "semuc",
  "champey",
  "tamal",
  "guatemalteco",
  "ceiba",
  "feria",
  "coban",
  "descargo",
  "version",
  "deberia",
  "verifico",
  "instalado",
  "visual",
  "studio",
  "code",
  "jupyter",
  "notebook",
  "diferencia",
  "entre",
  "y",
  "tuplas",
  "convierto",
  "while",
  "infinito",
  "declaro",
  "parametros",
  "opcionales",
  "multiples",
  "tipos",
  "clave",
  "existe",
  "agrego",
  "elimino",
  "dataframe",
  "columnas",
  "filtro",
  "otros",
  "frameworks",
  "ademas",
  "inicio",
  "rutas",
  "dinamicas",
  "guardo",
  "grafico",
  "paquetes",
  "propia",
  "llamo",
  "2",
  "3",
  "lento",
  "tipo",
  "cadena",
  "numero",
  "configuro",
  "windows",
  "linux",
  "varias",
  "instaladas",
  "ordenar",
  "duplicados",
  "fusiono",
  "diccionarios",
  "mis",
  "propias",
  "capturo",
  "cualquier",
  "nueva",
  "columna",
  "muy",
  "grande",
  "filas",
  "valores",
  "nulos",
  "formularios",
  "protejo",
  "aplicacion",
  "cambio",
  "color",
  "leyenda",
  "barras",
  "programo",
  "repetitivas",
  "automaticamente",
  "xela",
  "ubicada",
  "llama",
  "clima",
  "cerro",
  "baul",
  "platos",
  "tipicos",
  "comen",
  "quetzaltenango",
  "teatro",
  "municipal",
  "mercado",
  "democracia",
  "deportes",
  "populares",
  "centroamerica",
  "estan",
  "cerca",
  "volcan",
  "maria",
  "santiaguito",
  "festividades",
  "importantes",
  "celebran",
  "casa",
  "no'j",
  "lugares",
  "turisticos",
  "fuentes",
  "georginas",
  "chicharras",
  "historia",
  "cementerio",
  "general",
  "extremos",
  "pueden",
  "practicar",
  "universidades",
  "almolonga",
  "todos",
  "santos",
  "importancia",
  "actividades",
  "culturales",
  "grupos",
  "indigenas",
  "viven",
  "quetzalteco",
  "mirador",
  "cuchilla",
  "bebidas",
  "tipicas",
  "catedral",
  "espiritu",
  "santo",
  "mercados",
  "tradicionales",
  "alrededores",
  "iglesia",
  "san",
  "nicolas",
  "artesanias",
  "producen",
  "campus",
  "central",
  "usac",
  "salcaja",
  "caldo",
  "frutas",
  "fiestas",
  "religiosas",
  "papel",
  "educacion",
  "productos",
  "agricolas",
  "turisticas",
  "zunil",
  "videojuego",
  "invento",
  "videojuegos",
  "consola",
  "vendida",
  "'esports'",
  "pc",
  "gamer",
  "'streamer'",
  "fortnite",
  "minecraft",
  "rol",
  "vendido",
  "tiempos",
  "'battle",
  "royale'",
  "juego",
  "lucha",
  "'open",
  "world'",
  "'sandbox'",
  "'mmorpg'",
  "estrategia",
  "'expansion'",
  "'dlc'",
  "realidad",
  "super",
  "mario",
  "bros",
  "'speedrun'",
  "'gamer'",
  "'boss'",
  "disparos",
  "'grand",
  "theft",
  "auto'",
  "simulacion",
  "plataformas",
  "'rpg'",
  "league",
  "of",
  "legends",
  "modo",
  "cooperativo",
  "'call",
  "duty'",
  "accion",
  "multijugador",
  "'loot",
  "box'",
  "'mmo'",
  "'puzzle'",
  "carreras",
  "the",
  "legend",
  "zelda",
  "pac-man",
  "supervivencia",
  "'gacha'",
  "'rage",
  "quit'",
  "principales",
  "importante",
  "puede",
  "cambiar",
  "futuro",
  "terminos",
  "historicos",
  "afecta",
  "su",
  "agricultura",
  "eventos",
  "hace",
  "unico",
  "al",
  "'chuchitos'",
  "fueron",
  "inspirados",
  "mitologia",
  "uso",
  "2d",
  "3d",
  "mesa",
  "tecnologia",
  "modernos",
  "beneficios",
  "impacto",
  "industria",
  "cultural",
  "mejores",
  "turistas",
  "libre",
  "'bot'",
  "gamificacion",
  "saga",
  "'super",
  "mario'",
  "hacen",
  "origen",
  "'tetris'",
  "'boss",
  "fight'",
  "tienen",
  "salud",
  "mental",
  "'multiplayer'",
  "'moba'",
  "'world",
  "warcraft'",
  "juegos",
  "jugados",
  "mundo",
  "desarrollan",
  "interfaz",
  "usuario",
  "'game",
  "engine'",
  "primer",
  "terror",
  "'npc'",
  "'minecraft'",
  "adaptador",
  "adaptadores",
  "corriente",
  "video",
  "usb",
  "hdmi",
  "audio",
  "tarjeta",
  "sd",
  "conectar",
  "tv",
  "dispositivo",
  "iphone",
  "voltaje",
  "frecuencia",
  "digital",
  "laptop",
  "puerto",
  "convertidor",
  "universal",
  "diferente",
  "wi-fi",
  "ethernet",
  "telefono",
  "usb-c",
  "inalambrico",
  "bluetooth",
  "vga",
  "microusb",
  "tarjetas",
  "memoria",
  "alimentacion",
  "laptops",
  "saber",
  "cargar",
  "vehiculos",
  "rca",
  "lightning",
  "35mm",
  "audifonos",
  "proyector",
  "tecnologias",
  "usadas",
  "internet",
  "cosas",
  "(iot)",
  "nube",
  "blockchain",
  "cuantica",
  "big",
  "data",
  "ciberseguridad",
  "movil",
  "operativo",
  "navegador",
  "redes",
  "sociales",
  "5g",
  "microprocesador",
  "robot",
  "criptomonedas",
  "iot",
  "firewall",
  "aplicada",
  "drones",
  "portatil",
  "busqueda",
  "chip",
  "nfc",
  "diseno",
  "responsivo",
  "smartwatches",
  "servicio",
  "wearable",
  "virus",
  "informatico",
  "carrera",
  "ingenieria",
  "sistemas",
  "estudia",
  "cuanto",
  "dura",
  "habilidades",
  "necesitan",
  "estudiar",
  "areas",
  "trabajar",
  "ingeniero",
  "materias",
  "empresas",
  "aprenden",
  "necesario",
  "matematicas",
  "area",
  "ciencias",
  "trabaja",
  "solo",
  "gestion",
  "bases",
  "agil",
  "hardware",
  "testing",
  "prototipo",
  "requerimientos",
  "virtualizacion",
  "sector",
  "publico",
  "empresarial",
  "diagrama",
  "flujo",
  "desde",
  "cero",
  "importo",
  "biblioteca",
  "json",
  "darme",
  "contar",
  "palabras",
  "crear",
  "mysql",
  "imprimir",
  "mensaje",
  "declarar",
  "sumar",
  "condicion",
  "if",
  "for",
  "pasar",
  "argumentos",
  "retornar",
  "concatenar",
  "cadenas",
  "convertir",
  "acceder",
  "agregar",
  "verificar",
  "comprobar",
  "leer",
  "escribir",
  "generar",
  "aleatorio",
  "invertir",
  "veces",
  "aparece",
  "obtener",
  "indice",
  "set",
  "recursiva",
  "flotante",
  "vacia",
  "combinar",
  "claves",
  "elementos",
  "contiene",
  "encontrar",
  "maximo",
  "minimo",
  "ejecuta",
  "leo",
  "tamano",
  "entero",
  "ordeno",
  "invierto",
  "argumento",
  "defecto",
  "lambda",
  "map",
  "herencia",
  "genero",
  "aleatorios",
  "combino",
  "rest",
  "csv",
  "selecciono",
  "calcule",
  "factorial",
  "binaria",
  "convierta",
  "mayusculas",
  "cuente",
  "cantidad",
  "palabra",
  "segundo",
  "cada",
  "secuencia",
  "fibonacci",
  "primo",
  "calcular",
  "comun",
  "divisor",
  "(mcd)",
  "ocurrencias",
  "suma",
  "acepte",
  "verifique",
  "palindromo",
  "entrada",
  "lineal",
  "maneje",
  "estudiantes",
  "ordene",
  "longitud",
  "partir",
  "reciba",
  "especifica",
  "elimine",
  "repetidos",
  "potencia",
  "dividir",
  "partes",
  "pequenas",
  "cuantas",
  "sola",
  "ordenada",
  "devuelva",
  "nulo",
  "minusculas",
  "sus",
  "comunes",
  "uno",
  "validacion",
  "correo",
  "electronico",
  "metodo",
  "split()",
  "join()",
  "reverse()",
  "len()",
  "sort()",
  "comando",
  "install",
  "int()",
  "print()",
  "input()",
  "open()",
  "sorted()",
  "declaracion",
  "def",
  "operador",
  "+",
  "class",
  "append()",
  "remove()",
  "in",
  "keys()",
  "values()",
  "random",
  "filter()",
  "map()",
  "zip()",
  "pandasread_csv()",
  "numpyarray()",
  "pltplot()",
  "django-admin",
  "startproject",
  "add()",
  "pop()",
  "@staticmethod",
  "import",
  "mathsqrt()",
  "try-except",
  "enumerate()",
  "range()",
  "not",
  "==",
  "//",
  "**",
  "pandasdataframe()",
  "pltbar()",
  "iloc",
  "loc",
  "numpymean()",
  "numpymedian()",
  "numpystd()",
  "matplotlibpyplotshow()",
  "@classmethod",
  "@property",
  "isinstance()",
  "hasattr()",
  "getattr()",
  "setattr()",
  "dictget()",
  "pass",
  "yield",
  "popitem()",
  "clear()",
  "with",
  "isdigit()",
  "upper()",
  "lower()",
  "replace()",
  "eval()",
  "exec()",
  "is",
  "and",
  "assert",
  "all()",
  "any()",
  "max()",
  "min()",
  "count()",
  "index()",
  "round()",
  "strip()",
  "strings",
  "splitlines()",
  "startswith()",
  "endswith()",
  "abs()",
  "deepcopy()",
  "copy",
  "shallow",
  "copy()",
  "mathceil()",
  "mathfloor()",
  "mathlog()",
  "mathfactorial()",
  "randomchoice()",
  "randomshuffle()",
  "randomsample()",
  "osgetcwd()",
  "oslistdir()",
  "osremove()",
  "osmakedirs()",
  "shutilcopy()",
  "shutilmove()",
  "shutilrmtree()",
  "subprocessrun()",
  "datetimenow()",
  "datetimestrptime()",
  "timedelta",
  "datetime",
  "rematch()",
  "research()",
  "refindall()",
  "setattr",
  "devuelve",
  "utilidad",
  "randomrandint()",
  "fecha",
  "permite",
  "operacion",
  "realiza",
  "genera",
  "opera",
  "logra",
  "linea",
  "envio",
  "solicitud",
  "http",
  "post",
  "get",
  "sqlite",
  "print",
  "logging",
  "decorator",
  "crean",
  "contexto",
  "__init__",
  "pruebas",
  "unitarias",
  "pytest",
  "manipulo",
  "fechas",
  "pep",
  "8",
  "comprensiones",
  "`is`",
  "`==`",
  "`with`",
  "`w`",
  "`a`",
  "abrir",
  "`del`",
  "personalizada",
  "restful",
  "pruebo",
  "torta",
  "`deepcopy`",
  "`copy`",
  "promesas",
  "`callback`",
  "dom",
  "nodejs",
  "evento",
  "middleware",
  "express",
  "consultas",
  "patron",
  "microservicios",
  "ci/cd",
  "contenedor",
  "kubernetes",
  "cola",
  "mensajes",
  "relacional",
  "graphql",
  "endpoint",
  "migraciones",
  "orm",
  "proxy",
  "websocket",
  "hashing",
  "reactiva",
  "balanceador",
  "carga",
  "certificado",
  "ssl",
  "arquitectura",
  "monolitica",
  "front-end",
  "back-end",
  "concurrencia",
  "paralelizacion",
  "hilos",
  "asincrona",
  "cache",
  "docker",
  "maquina",
  "dns",
  "arbol",
  "binario",
  "get()",
  "paralelo",
  "magico",
  "*args",
  "**kwargs",
  "generadora",
  "abstracta",
  "propiedades",
  "implementa",
  "singleton",
  "`in`",
  "metaclases",
  "serializacion",
  "deepcopy",
  "define",
  "estatico",
  "multiple",
  "`super()`",
  "`__repr__`",
  "comparar",
  "namedtuple",
  "medir",
  "ejecucion",
  "pila",
  "`collectionscounter`",
  "`collectionsdeque`",
  "itertools",
  "`functoolslru_cache`",
  "`dataclasses`",
  "descriptor",
  "`__getattr__`",
  "anidado",
  "hilo",
  "`asyncio`",
  "implementar",
  "manejador",
  "senales",
  "`join`",
  "comprimidos",
  "`__call__`",
  "contextos",
  "asincronos",
  "`sched`",
  "`argparse`",
  "`socket`",
  "conectarse",
  "`typing`",
  "`__del__`",
  "implemento",
  "`:=`",
  "`__getitem__`",
  "`__setitem__`",
  "comandos",
  "`ossystem`",
  "`subprocessrun`",
  "limitar",
  "`weakref`",
  "inmutable",
  "recolector",
  "basura",
  "deshabilitar",
  "`contextlib`",
  "`abc`",
  "personalizados",
  "`itertoolscombinations`",
  "`osenviron`",
  "comprimir",
  "`pathlib`",
  "forma",
  "multiplataforma",
  "`__slots__`",
  "`keyerror`",
  "`uuid`",
  "temporal",
  "`timeit`",
  "`pickle`",
  "`for-else`",
  "`**`",
  "`isinstance`",
  "`type`",
  "`secrets`",
  "sea",
  "walrus",
  "lugar",
  "metodos",
  "util",
  "preferir",
  "reducir",
  "estructuras",
  "grandes",
  "mutable",
  "e",
  "liberar",
  "manualmente",
  "ventajas",
  "ofrece",
  "manejadores",
  "usarla",
  "personalizadas",
  "`itertools`",
  "combinaciones",
  "utilizar",
  "configuraciones",
  "`gzip`",
  "usarlo",
  "`pyc`",
  "`ospath`",
  "evitar",
  "identificadores",
  "exacto",
  "fragmento",
  "eficiente",
  "maneja",
  "bucles",
  "`random`",
  "generadores",
  "clausula",
  "`yield",
  "from`",
  "`__str__`",
  "sin",
  "cargarlos",
  "completamente",
  "decoradores",
  "descendente",
  "obtengo",
  "division",
  "filtrar",
  "separada",
  "comas",
  "copio",
  "detener",
  "antes",
  "termine",
  "calculo",
  "interseccion",
  "conjuntos",
  "defino",
  "constructor",
  "actuales",
  "par",
  "impar",
  "consulta",
  "`for`",
  "`while`",
  "imprimo",
  "algo",
  "pantalla",
  "pido",
  "`if`",
  "`if-else`",
  "paso",
  "recorrer",
  "positivo",
  "salto",
  "siguiente",
  "iteracion",
  "ultimo",
  "imprime",
  "mayor",
  "concateno",
  "recorra",
  "divido",
  "resto",
  "repetir",
  "especifico",
  "consecutivos",
  "compruebo",
  "constante",
  "espere",
  "unos",
  "segundos",
  "comparacion",
  "`elif`",
  "terminar",
  "multiplico",
  "`pass`",
  "redondear"
]