[
  "hola",
  "buenos",
  "dias",
  "hey",
  "como",
  "estas",
  "que",
  "tal",
  "buenas",
  "tardes",
  "noches",
  "todo",
  "onda",
  "gusto",
  "saludarte",
  "bien",
  "te",
  "va",
  "hay",
  "de",
  "nuevo",
  "hoy",
  "pasa",
  "saludos",
  "andas",
  "verte",
  "esta",
  "en",
  "el",
  "dia",
  "tu",
  "la",
  "vida",
  "ha",
  "ido",
  "por",
  "ahi",
  "encuentras",
  "aqui",
  "novedades",
  "tienes",
  "yendo",
  "orden",
  "contigo",
  "hasta",
  "luego",
  "nos",
  "vemos",
  "pronto",
  "adios",
  "gracias",
  "ayuda",
  "hablamos",
  "chao",
  "proxima",
  "cuidate",
  "veo",
  "bueno",
  "me",
  "voy",
  "puedes",
  "despedirte",
  "fue",
  "un",
  "placer",
  "otro",
  "momento",
  "descanses",
  "tiempo",
  "tengo",
  "ir",
  "tengas",
  "buen",
  "retiro",
  "agradezco",
  "mucho",
  "es",
  "hora",
  "irme",
  "estes",
  "amigo",
  "ya",
  "descanso",
  "a",
  "descansar",
  "proximo",
  "encuentro",
  "vuelvo",
  "estar",
  "vaya",
  "vista",
  "manana",
  "otra",
  "ocasion",
  "despido",
  "despues",
  "quiero",
  "aprender",
  "python",
  "ensenar",
  "usar",
  "hago",
  "programa",
  "muestrame",
  "ejemplo",
  "basico",
  "oye",
  "sumo",
  "dos",
  "numeros",
  "bucle",
  "explicame",
  "una",
  "funcion",
  "creo",
  "archivo",
  "explicarme",
  "lista",
  "bro",
  "manejo",
  "errores",
  "librerias",
  "recomiendas",
  "ensename",
  "instalar",
  "libreria",
  "sobre",
  "pandas",
  "mostrarme",
  "usando",
  "empiezo",
  "con",
  "django",
  "puedo",
  "hacer",
  "ayudarme",
  "problema",
  "mi",
  "codigo",
  "escribo",
  "conecto",
  "base",
  "datos",
  "clase",
  "para",
  "aplicaciones",
  "web",
  "ayudame",
  "loops",
  "anidados",
  "decorador",
  "interactivo",
  "ayudas",
  "expresiones",
  "regulares",
  "graficos",
  "automatizar",
  "tareas",
  "sirve",
  "lenguaje",
  "dificil",
  "quien",
  "variable",
  "gratuito",
  "ide",
  "son",
  "las",
  "bibliotecas",
  "modulo",
  "se",
  "declara",
  "diccionario",
  "excepciones",
  "compilado",
  "o",
  "interpretado",
  "string",
  "comentan",
  "lineas",
  "objeto",
  "flask",
  "numpy",
  "paquete",
  "pip",
  "tupla",
  "crea",
  "conjunto",
  "py",
  "pyc",
  "ejecutar",
  "script",
  "interprete",
  "soporta",
  "programacion",
  "orientada",
  "objetos",
  "comprension",
  "recursion",
  "case-sensitive",
  "iterador",
  "generador",
  "breakpoint",
  "multilinea",
  "indentacion",
  "'print'",
  "'input'",
  "manejar",
  "archivos",
  "zen",
  "programar",
  "lenguajes",
  "existen",
  "necesito",
  "empezar",
  "algoritmo",
  "error",
  "sintaxis",
  "significa",
  "depuracion",
  "framework",
  "condicional",
  "fuente",
  "funcional",
  "array",
  "enlazada",
  "compilador",
  "repositorio",
  "control",
  "versiones",
  "git",
  "commit",
  "rama",
  "merge",
  "html",
  "css",
  "javascript",
  "backend",
  "frontend",
  "api",
  "sql",
  "nosql",
  "servidor",
  "prueba",
  "unitaria",
  "ciclo",
  "del",
  "software",
  "red",
  "neuronal",
  "inteligencia",
  "artificial",
  "aprendizaje",
  "automatico",
  "entorno",
  "desarrollo",
  "cuales",
  "supervisado",
  "no",
  "refuerzo",
  "procesamiento",
  "natural",
  "vision",
  "computadora",
  "modelo",
  "chatbot",
  "asistente",
  "virtual",
  "reconocimiento",
  "voz",
  "analisis",
  "sentimientos",
  "generativo",
  "gan",
  "clustering",
  "transferencia",
  "estilo",
  "sistema",
  "experto",
  "robotica",
  "agente",
  "inteligente",
  "etica",
  "los",
  "entrenamiento",
  "sobreajuste",
  "subestimacion",
  "regresion",
  "clasificacion",
  "predictivo",
  "computacion",
  "cognitiva",
  "automatizacion",
  "procesos",
  "mineria",
  "fuerte",
  "debil",
  "costo",
  "facial",
  "sesgo",
  "algoritmico",
  "transparencia",
  "ia",
  "preentrenado",
  "profundo",
  "secuencial",
  "hiperparametro",
  "distribuida",
  "grafo",
  "conocimiento",
  "optico",
  "caracteres",
  "enjambre",
  "regularizacion",
  "real",
  "aumentada",
  "sintetico",
  "usa",
  "editor",
  "texto",
  "instalo",
  "si",
  "funciona",
  "ejecuto",
  "terminal",
  "tener",
  "listas",
  "dentro",
  "accedo",
  "elemento",
  "rango",
  "detengo",
  "parametro",
  "retorno",
  "valor",
  "'w'",
  "open",
  "excepcion",
  "eliminar",
  "cargo",
  "matplotlib",
  "donde",
  "encuentra",
  "guatemala",
  "cual",
  "capital",
  "moneda",
  "idioma",
  "habla",
  "ave",
  "nacional",
  "nombre",
  "fiambre",
  "cuando",
  "celebra",
  "independencia",
  "popol",
  "vuh",
  "huipil",
  "sitio",
  "arqueologico",
  "mas",
  "famoso",
  "marimba",
  "rincon",
  "cafe",
  "semana",
  "santa",
  "lago",
  "atitlan",
  "cuantos",
  "departamentos",
  "tiene",
  "ruinas",
  "quirigua",
  "miguel",
  "angel",
  "asturias",
  "barriletes",
  "gigantes",
  "comida",
  "tipica",
  "monumento",
  "tecun",
  "uman",
  "antigua",
  "jade",
  "cultura",
  "guatemalteca",
  "rabinal",
  "achi",
  "volcanes",
  "paabanc",
  "cacao",
  "mayas",
  "chichicastenango",
  "museo",
  "ixchel",
  "tejidos",
  "guatemaltecos",
  "parque",
  "tikal",
  "representa",
  "bandera",
  "palo",
  "volador",
  "carnaval",
  "mazatenango",
  "festival",
  "santiago",
  "zona",
  "arqueologica",
  "yaxha",
  "chiles",
  "rellenos",
  "ejercito",
  "rio",
  "dulce",
  "palacio",
  "calendario",
  "maya",
  "musica",
  "difuntos",
  "semuc",
  "champey",
  "tamal",
  "guatemalteco",
  "ceiba",
  "feria",
  "coban",
  "descargo",
  "version",
  "deberia",
  "verifico",
  "instalado",
  "visual",
  "studio",
  "code",
  "jupyter",
  "notebook",
  "diferencia",
  "entre",
  "y",
  "tuplas",
  "convierto",
  "while",
  "infinito",
  "declaro",
  "parametros",
  "opcionales",
  "multiples",
  "tipos",
  "clave",
  "existe",
  "agrego",
  "elimino",
  "dataframe",
  "columnas",
  "filtro",
  "otros",
  "frameworks",
  "ademas",
  "inicio",
  "rutas",
  "dinamicas",
  "guardo",
  "grafico",
  "paquetes",
  "propia",
  "llamo",
  "2",
  "3",
  "lento",
  "tipo",
  "cadena",
  "numero",
  "configuro",
  "windows",
  "linux",
  "varias",
  "instaladas",
  "ordenar",
  "duplicados",
  "fusiono",
  "diccionarios",
  "mis",
  "propias",
  "capturo",
  "cualquier",
  "nueva",
  "columna",
  "muy",
  "grande",
  "filas",
  "valores",
  "nulos",
  "formularios",
  "protejo",
  "aplicacion",
  "cambio",
  "color",
  "leyenda",
  "barras",
  "programo",
  "repetitivas",
  "automaticamente",
  "xela",
  "ubicada",
  "llama",
  "clima",
  "cerro",
  "baul",
  "platos",
  "tipicos",
  "comen",
  "quetzaltenango",
  "teatro",
  "municipal",
  "mercado",
  "democracia",
  "deportes",
  "populares",
  "centroamerica",
  "estan",
  "cerca",
  "volcan",
  "maria",
  "santiaguito",
  "festividades",
  "importantes",
  "celebran",
  "casa",
  "no'j",
  "lugares",
  "turisticos",
  "fuentes",
  "georginas",
  "chicharras",
  "historia",
  "cementerio",
  "general",
  "extremos",
  "pueden",
  "practicar",
  "universidades",
  "almolonga",
  "todos",
  "santos",
  "importancia",
  "actividades",
  "culturales",
  "grupos",
  "indigenas",
  "viven",
  "quetzalteco",
  "mirador",
  "cuchilla",
  "bebidas",
  "tipicas",
  "catedral",
  "espiritu",
  "santo",
  "mercados",
  "tradicionales",
  "alrededores",
  "iglesia",
  "san",
  "nicolas",
  "artesanias",
  "producen",
  "campus",
  "central",
  "usac",
  "salcaja",
  "caldo",
  "frutas",
  "fiestas",
  "religiosas",
  "papel",
  "educacion",
  "productos",
  "agricolas",
  "turisticas",
  "zunil",
  "videojuego",
  "invento",
  "videojuegos",
  "consola",
  "vendida",
  "'esports'",
  "pc",
  "gamer",
  "'streamer'",
  "fortnite",
  "minecraft",
  "rol",
  "vendido",
  "tiempos",
  "'battle",
  "royale'",
  "juego",
  "lucha",
  "'open",
  "world'",
  "'sandbox'",
  "'mmorpg'",
  "estrategia",
  "'expansion'",
  "'dlc'",
  "realidad",
  "super",
  "mario",
  "bros",
  "'speedrun'",
  "'gamer'",
  "'boss'",
  "disparos",
  "'grand",
  "theft",
  "auto'",
  "simulacion",
  "plataformas",
  "'rpg'",
  "league",
  "of",
  "legends",
  "modo",
  "cooperativo",
  "'call",
  "duty'",
  "accion",
  "multijugador",
  "'loot",
  "box'",
  "'mmo'",
  "'puzzle'",
  "carreras",
  "the",
  "legend",
  "zelda",
  "pac-man",
  "supervivencia",
  "'gacha'",
  "'rage",
  "quit'",
  "principales",
  "importante",
  "puede",
  "cambiar",
  "futuro",
  "terminos",
  "historicos",
  "afecta",
  "su",
  "agricultura",
  "eventos",
  "hace",
  "unico",
  "al",
  "'chuchitos'",
  "fueron",
  "inspirados",
  "mitologia",
  "uso",
  "2d",
  "3d",
  "mesa",
  "tecnologia",
  "modernos",
  "beneficios",
  "impacto",
  "industria",
  "cultural",
  "mejores",
  "turistas",
  "libre",
  "'bot'",
  "gamificacion",
  "saga",
  "'super",
  "mario'",
  "hacen",
  "origen",
  "'tetris'",
  "'boss",
  "fight'",
  "tienen",
  "salud",
  "mental",
  "'multiplayer'",
  "'moba'",
  "'world",
  "warcraft'",
  "juegos",
  "jugados",
  "mundo",
  "desarrollan",
  "interfaz",
  "usuario",
  "'game",
  "engine'",
  "primer",
  "terror",
  "'npc'",
  "'minecraft'",
  "adaptador",
  "adaptadores",
  "corriente",
  "video",
  "usb",
  "hdmi",
  "audio",
  "tarjeta",
  "sd",
  "conectar",
  "tv",
  "dispositivo",
  "iphone",
  "voltaje",
  "frecuencia",
  "digital",
  "laptop",
  "puerto",
  "convertidor",
  "universal",
  "diferente",
  "wi-fi",
  "ethernet",
  "telefono",
  "usb-c",
  "inalambrico",
  "bluetooth",
  "vga",
  "microusb",
  "tarjetas",
  "memoria",
  "alimentacion",
  "laptops",
  "saber",
  "cargar",
  "vehiculos",
  "rca",
  "lightning",
  "35mm",
  "audifonos",
  "proyector",
  "tecnologias",
  "usadas",
  "internet",
  "cosas",
  "(iot)",
  "nube",
  "blockchain",
  "cuantica",
  "big",
  "data",
  "ciberseguridad",
  "movil",
  "operativo",
  "navegador",
  "redes",
  "sociales",
  "5g",
  "microprocesador",
  "robot",
  "criptomonedas",
  "iot",
  "firewall",
  "aplicada",
  "drones",
  "portatil",
  "busqueda",
  "chip",
  "nfc",
  "diseno",
  "responsivo",
  "smartwatches",
  "servicio",
  "wearable",
  "virus",
  "informatico",
  "carrera",
  "ingenieria",
  "sistemas",
  "estudia",
  "cuanto",
  "dura",
  "habilidades",
  "necesitan",
  "estudiar",
  "areas",
  "trabajar",
  "ingeniero",
  "materias",
  "empresas",
  "aprenden",
  "necesario",
  "matematicas",
  "area",
  "ciencias",
  "trabaja",
  "solo",
  "gestion",
  "bases",
  "agil",
  "hardware",
  "testing",
  "prototipo",
  "requerimientos",
  "virtualizacion",
  "sector",
  "publico",
  "empresarial",
  "diagrama",
  "flujo",
  "desde",
  "cero",
  "importo",
  "biblioteca",
  "json",
  "darme",
  "contar",
  "palabras",
  "crear",
  "mysql",
  "imprimir",
  "mensaje",
  "declarar",
  "sumar",
  "condicion",
  "if",
  "for",
  "pasar",
  "argumentos",
  "retornar",
  "concatenar",
  "cadenas",
  "convertir",
  "acceder",
  "agregar",
  "verificar",
  "comprobar",
  "leer",
  "escribir",
  "generar",
  "aleatorio",
  "invertir",
  "veces",
  "aparece",
  "obtener",
  "indice",
  "set",
  "recursiva",
  "flotante",
  "vacia",
  "combinar",
  "claves",
  "elementos",
  "contiene",
  "encontrar",
  "maximo",
  "minimo",
  "ejecuta",
  "leo",
  "tamano",
  "entero",
  "ordeno",
  "invierto",
  "argumento",
  "defecto",
  "lambda",
  "map",
  "herencia",
  "genero",
  "aleatorios",
  "combino",
  "rest",
  "csv",
  "selecciono",
  "calcule",
  "factorial",
  "binaria",
  "convierta",
  "mayusculas",
  "cuente",
  "cantidad",
  "palabra",
  "segundo",
  "cada",
  "secuencia",
  "fibonacci",
  "primo",
  "calcular",
  "comun",
  "divisor",
  "(mcd)",
  "ocurrencias",
  "suma",
  "acepte",
  "verifique",
  "palindromo",
  "entrada",
  "lineal",
  "maneje",
  "estudiantes",
  "ordene",
  "longitud",
  "partir",
  "reciba",
  "especifica",
  "elimine",
  "repetidos",
  "potencia",
  "dividir",
  "partes",
  "pequenas",
  "cuantas",
  "sola",
  "ordenada",
  "devuelva",
  "nulo",
  "minusculas",
  "sus",
  "comunes",
  "uno",
  "validacion",
  "correo",
  "electronico",
  "metodo",
  "split()",
  "join()",
  "reverse()",
  "len()",
  "sort()",
  "comando",
  "install",
  "int()",
  "print()",
  "input()",
  "open()",
  "sorted()",
  "declaracion",
  "def",
  "operador",
  "+",
  "class",
  "append()",
  "remove()",
  "in",
  "keys()",
  "values()",
  "random",
  "filter()",
  "map()",
  "zip()",
  "pandasread_csv()",
  "numpyarray()",
  "pltplot()",
  "django-admin",
  "startproject",
  "add()",
  "pop()",
  "@staticmethod",
  "import",
  "mathsqrt()",
  "try-except",
  "enumerate()",
  "range()",
  "not",
  "==",
  "//",
  "**",
  "pandasdataframe()",
  "pltbar()",
  "iloc",
  "loc",
  "numpymean()",
  "numpymedian()",
  "numpystd()",
  "matplotlibpyplotshow()",
  "@classmethod",
  "@property",
  "isinstance()",
  "hasattr()",
  "getattr()",
  "setattr()",
  "dictget()",
  "pass",
  "yield",
  "popitem()",
  "clear()",
  "with",
  "isdigit()",
  "upper()",
  "lower()",
  "replace()",
  "eval()",
  "exec()",
  "is",
  "and",
  "assert",
  "all()",
  "any()",
  "max()",
  "min()",
  "count()",
  "index()",
  "round()",
  "strip()",
  "strings",
  "splitlines()",
  "startswith()",
  "endswith()",
  "abs()",
  "deepcopy()",
  "copy",
  "shallow",
  "copy()",
  "mathceil()",
  "mathfloor()",
  "mathlog()",
  "mathfactorial()",
  "randomchoice()",
  "randomshuffle()",
  "randomsample()",
  "osgetcwd()",
  "oslistdir()",
  "osremove()",
  "osmakedirs()",
  "shutilcopy()",
  "shutilmove()",
  "shutilrmtree()",
  "subprocessrun()",
  "datetimenow()",
  "datetimestrptime()",
  "timedelta",
  "datetime",
  "rematch()",
  "research()",
  "refindall()",
  "setattr",
  "devuelve",
  "utilidad",
  "randomrandint()",
  "fecha",
  "permite",
  "operacion",
  "realiza",
  "genera",
  "opera",
  "logra",
  "linea",
  "envio",
  "solicitud",
  "http",
  "post",
  "get",
  "sqlite",
  "print",
  "logging",
  "decorator",
  "crean",
  "contexto",
  "__init__",
  "pruebas",
  "unitarias",
  "pytest",
  "manipulo",
  "fechas",
  "pep",
  "8",
  "comprensiones",
  "`is`",
  "`==`",
  "`with`",
  "`w`",
  "`a`",
  "abrir",
  "`del`",
  "personalizada",
  "restful",
  "pruebo",
  "torta",
  "`deepcopy`",
  "`copy`",
  "promesas",
  "`callback`",
  "dom",
  "nodejs",
  "evento",
  "middleware",
  "express",
  "consultas",
  "patron",
  "microservicios",
  "ci/cd",
  "contenedor",
  "kubernetes",
  "cola",
  "mensajes",
  "relacional",
  "graphql",
  "endpoint",
  "migraciones",
  "orm",
  "proxy",
  "websocket",
  "hashing",
  "reactiva",
  "balanceador",
  "carga",
  "certificado",
  "ssl",
  "arquitectura",
  "monolitica",
  "front-end",
  "back-end",
  "concurrencia",
  "paralelizacion",
  "hilos",
  "asincrona",
  "cache",
  "docker",
  "maquina",
  "dns",
  "arbol",
  "binario",
  "get()",
  "paralelo",
  "magico",
  "*args",
  "**kwargs",
  "generadora",
  "abstracta",
  "propiedades",
  "implementa",
  "singleton",
  "`in`",
  "metaclases",
  "serializacion",
  "deepcopy",
  "define",
  "estatico",
  "multiple",
  "`super()`",
  "`__repr__`",
  "comparar",
  "namedtuple",
  "medir",
  "ejecucion",
  "pila",
  "`collectionscounter`",
  "`collectionsdeque`",
  "itertools",
  "`functoolslru_cache`",
  "`dataclasses`",
  "descriptor",
  "`__getattr__`",
  "anidado",
  "hilo",
  "`asyncio`",
  "implementar",
  "manejador",
  "senales",
  "`join`",
  "comprimidos",
  "`__call__`",
  "contextos",
  "asincronos",
  "`sched`",
  "`argparse`",
  "`socket`",
  "conectarse",
  "`typing`",
  "`__del__`",
  "implemento",
  "`:=`",
  "`__getitem__`",
  "`__setitem__`",
  "comandos",
  "`ossystem`",
  "`subprocessrun`",
  "limitar",
  "`weakref`",
  "inmutable",
  "recolector",
  "basura",
  "deshabilitar",
  "`contextlib`",
  "`abc`",
  "personalizados",
  "`itertoolscombinations`",
  "`osenviron`",
  "comprimir",
  "`pathlib`",
  "forma",
  "multiplataforma",
  "`__slots__`",
  "`keyerror`",
  "`uuid`",
  "temporal",
  "`timeit`",
  "`pickle`",
  "`for-else`",
  "`**`",
  "`isinstance`",
  "`type`",
  "`secrets`",
  "sea",
  "walrus",
  "lugar",
  "metodos",
  "util",
  "preferir",
  "reducir",
  "estructuras",
  "grandes",
  "mutable",
  "e",
  "liberar",
  "manualmente",
  "ventajas",
  "ofrece",
  "manejadores",
  "usarla",
  "personalizadas",
  "`itertools`",
  "combinaciones",
  "utilizar",
  "configuraciones",
  "`gzip`",
  "usarlo",
  "`pyc`",
  "`ospath`",
  "evitar",
  "identificadores",
  "exacto",
  "fragmento",
  "eficiente",
  "maneja",
  "bucles",
  "`random`",
  "generadores",
  "clausula",
  "`yield",
  "from`",
  "`__str__`",
  "sin",
  "cargarlos",
  "completamente",
  "decoradores",
  "descendente",
  "obtengo",
  "division",
  "filtrar",
  "separada",
  "comas",
  "copio",
  "detener",
  "antes",
  "termine",
  "calculo",
  "interseccion",
  "conjuntos",
  "defino",
  "constructor",
  "actuales",
  "par",
  "impar",
  "consulta",
  "`for`",
  "`while`",
  "imprimo",
  "algo",
  "pantalla",
  "pido",
  "`if`",
  "`if-else`",
  "paso",
  "recorrer",
  "positivo",
  "salto",
  "siguiente",
  "iteracion",
  "ultimo",
  "imprime",
  "mayor",
  "concateno",
  "recorra",
  "divido",
  "resto",
  "repetir",
  "especifico",
  "consecutivos",
  "compruebo",
  "constante",
  "espere",
  "unos",
  "segundos",
  "comparacion",
  "`elif`",
  "terminar",
  "multiplico",
  "`pass`",
  "redondear",
  "cpu",
  "ram",
  "disco",
  "duro",
  "operativos",
  "grafica",
  "placa",
  "sonido",
  "informatica",
  "bios",
  "madre",
  "perifericos",
  "teclado",
  "raton",
  "mouse",
  "impresora",
  "monitor",
  "expansion",
  "64",
  "bits",
  "direccion",
  "ip",
  "almacenamiento",
  "ssd",
  "enfriamiento",
  "byte",
  "bit",
  "gpu",
  "overclocking",
  "conectividad",
  "antivirus",
  "externo",
  "procesador",
  "salida",
  "tecnologicos",
  "comunicacion",
  "embebido",
  "informacion",
  "distribuidos",
  "seguridad",
  "cibernetica",
  "inalambrica",
  "contenido",
  "monitoreo",
  "remoto",
  "navegacion",
  "pagos",
  "soporte",
  "tecnico",
  "industrial",
  "recomendacion",
  "mensajeria",
  "instantanea",
  "deteccion",
  "intrusos",
  "proteccion",
  "contra",
  "desastres",
  "respaldo",
  "trafico",
  "pago",
  "inventario",
  "hogar",
  "verificacion",
  "identidad",
  "darle",
  "asignar",
  "decimal",
  "asigno",
  "inicial",
  "incorrecto",
  "espacios",
  "nombres",
  "variables",
  "sensibles",
  "reglas",
  "nombrar",
  "global",
  "local",
  "interpolacion",
  "booleano",
  "vacio",
  "haberla",
  "creado",
  "intento",
  "he",
  "definido",
  "borro",
  "reservadas",
  "dinamica",
  "declararla",
  "instancia",
  "`global`",
  "numericas",
  "iterar",
  "`range()`",
  "termina",
  "`continue`",
  "usan",
  "`break`",
  "saltarme",
  "modificar",
  "mientras",
  "recorre",
  "`else`",
  "imprima",
  "1",
  "10",
  "ejecute",
  "5",
  "negativos",
  "sucede",
  "olvido",
  "romper",
  "verdadera",
  "vez",
  "salir",
  "relacionado",
  "acerca",
  "teoria",
  "sabes",
  "computadoras",
  "falsa",
  "contador",
  "inverso",
  "esperar",
  "cause",
  "problemas",
  "itere",
  "dependa",
  "decreciente",
  "mayores",
  "multiplicar",
  "cambia",
  "impares",
  "pero",
  "omitir",
  "encontrado",
  "cuadrados",
  "cumple",
  "haga",
  "cumpla",
  "temas",
  "abarcar",
  "ensenarme",
  "ofrecerme",
  "ayudar",
  "resolver",
  "eres",
  "abordar",
  "relacionados",
  "entender",
  "abarcas",
  "instruccion",
  "estructura",
  "ternario",
  "posible",
  "anidar",
  "`and`",
  "operadores",
  "ternarios",
  "condiciones",
  "igualdad",
  "negativo",
  "falso",
  "`or`",
  "basado",
  "complejas",
  "igual",
  "divisible",
  "`none`",
  "realizar",
  "opciones",
  "bloque",
  "menor",
  "`pip`",
  "`math`",
  "importar",
  "`os`",
  "`datetime`",
  "`requests`",
  "`numpy`",
  "`pandas`",
  "`matplotlib`",
  "`seaborn`",
  "`json`",
  "`tkinter`",
  "ventana",
  "`scikit-learn`",
  "`flask`",
  "`sqlalchemy`",
  "`beautifulsoup4`",
  "extraer",
  "pagina",
  "`pytest`",
  "`nltk`",
  "`openpyxl`",
  "excel",
  "`pyqt`",
  "matriz",
  "`pillow`",
  "imagen",
  "`scipy`",
  "`statsmodels`",
  "`pyinstaller`",
  "ejecutable",
  "tratar",
  "conocimientos",
  "ofrecer",
  "dudas",
  "ser",
  "ambito",
  "proyectos",
  "podrias",
  "mejor",
  "concepto",
  "apoyarme",
  "formas",
  "especificamente",
  "estoy",
  "aprendiendo",
  "conceptos",
  "complicados",
  "preguntas",
  "responder",
  "practicos",
  "tema",
  "entiendo",
  "arreglo",
  "diferentes",
  "insertar",
  "posicion",
  "arreglos",
  "cortar",
  "fuera",
  "copiar",
  "varios",
  "0",
  "9",
  "enteros",
  "iguales",
  "bidimensional",
  "ordenado",
  "tenga",
  "unicos",
  "agrupar",
  "interrumpir",
  "for-else",
  "indices",
  "salte",
  "hacia",
  "atras",
  "pares",
  "ciclos",
  "relaciona",
  "mismo",
  "cuerpo",
  "cantidades",
  "recorro",
  "debo",
  "poner",
  "repito",
  "empiece",
  "iterable",
  "pongo",
  "nada",
  "siempre",
  "evito",
  "compuesta",
  "`true`",
  "detenga",
  "incrementar",
  "pedir",
  "valida",
  "infinitamente",
  "100",
  "break",
  "continue",
  "range",
  "input",
  "len",
  "str",
  "int",
  "float",
  "type",
  "enumerate",
  "zip",
  "%",
  "filter",
  "return",
  "append",
  "pop",
  "split",
  "join",
  "upper",
  "lower",
  "termino",
  "dato",
  "logico",
  "repita",
  "calculos",
  "dir",
  "tarea",
  "visitar",
  "algoritmos",
  "u",
  "componentes",
  "armar",
  "diaria",
  "optimizo",
  "rendimiento",
  "necesitas",
  "disenar",
  "esenciales",
  "modernas",
  "proyecto",
  "aprendo",
  "utiles",
  "rapido",
  "caracteristicas",
  "dispositivos",
  "utilizan",
  "preparo",
  "trabajo",
  "considerar",
  "comprar",
  "sociedad",
  "moderna",
  "realizan",
  "aplica",
  "distribuido",
  "centralizado",
  "influye",
  "economia",
  "motores",
  "principiantes",
  "monitores",
  "herramientas",
  "procesar",
  "imagenes",
  "impulsando",
  "sesion",
  "revolucionando",
  "elegir",
  "energia",
  "practicas",
  "tecnicas",
  "integrar",
  "existente",
  "mejorar",
  "eficiencia",
  "energetica",
  "construir",
  "empresariales",
  "contribuyen",
  "social",
  "ideales",
  "proyectores",
  "antiguos",
  "desafios",
  "enfrenta",
  "tecnologico",
  "analizar",
  "java",
  "tensorflow",
  "motor",
  "unity",
  "ray",
  "tracing",
  "pygame",
  "lake",
  "fastapi",
  "scikit-learn",
  "opencv",
  "alto",
  "nivel",
  "evitarlo",
  "frente",
  "compatible",
  "optimizar",
  "use",
  "pasos",
  "seguir",
  "entrenado",
  "usos",
  "filtra",
  "nodo",
  "etiquetados",
  "convolucional",
  "clasifican",
  "segun",
  "conexiones",
  "entrenar",
  "pytorch",
  "agrupamiento",
  "displayport",
  "recurrente",
  "renderizar",
  "diferencias",
  "primaria",
  "k-means",
  "relacionales",
  "basica",
  "centroide",
  "feedforward",
  "agrupaciones",
  "entreno",
  "optimizada",
  "foranea",
  "ajusto",
  "deben",
  "valido",
  "cliente-servidor",
  "visualizar",
  "tablas",
  "overfitting",
  "underfitting",
  "probar",
  "creada",
  "elijo",
  "fine-tuning",
  "lo",
  "seaborn",
  "`left",
  "join`",
  "`inner",
  "comparo",
  "modelos",
  "cruzada",
  "l1",
  "l2",
  "elastic",
  "net",
  "dispersion",
  "auc-roc",
  "interpreta",
  "metrica",
  "evaluacion",
  "integro",
  "logistica",
  "precision",
  "recall",
  "interpretar",
  "calor",
  "caja",
  "bigotes",
  "sparsidad",
  "confusion",
  "hiperparametros",
  "interpreto",
  "gridsearchcv",
  "randomizedsearchcv",
  "identifico",
  "atipicos",
  "metricas",
  "evaluar",
  "cuartil",
  "cuadratico",
  "medio",
  "(mse)",
  "calcula",
  "coeficiente",
  "determinacion",
  "r²",
  "falsos",
  "positivos",
  "umbral",
  "regularizado",
  "f1-score",
  "evaluo",
  "estratificada",
  "determino",
  "outlier",
  "residuales",
  "mae",
  "pipeline",
  "apiladas",
  "curva",
  "roc",
  "tradiciones",
  "destacan",
  "antiguo",
  "avanzado",
  "ultimos",
  "anos",
  "computo",
  "realistas",
  "unicas",
  "tecnologica",
  "recursos",
  "necesita",
  "servicios",
  "creciendo",
  "avances",
  "facilitan",
  "moviles",
  "tajumulco",
  "afectan",
  "startups",
  "tecnologicas",
  "fisico",
  "avanzada",
  "zoom",
  "google",
  "meet",
  "coworking",
  "mongodb",
  "suelen",
  "realizarse",
  "macbook",
  "ejemplos",
  "han",
  "desarrollado",
  "factores",
  "transformando",
  "negocios",
  "educativos",
  "especificaciones",
  "debe",
  "ferias",
  "mide",
  "calidad",
  "oficina",
  "tradicional",
  "hackatones",
  "comunidad",
  "resolucion",
  "4k",
  "necesarias",
  "desarrollar",
  "conexion",
  "experiencia",
  "hackaton",
  "participar",
  "flutter",
  "react",
  "native",
  "pantallas",
  "startup",
  "empresa",
  "innovacion",
  "alla",
  "colaboracion",
  "home",
  "office",
  "ensenan",
  "productividad",
  "guatemaltecas",
  "reconocidas",
  "internacionalmente",
  "idiomas",
  "hablan",
  "espanol",
  "destinos",
  "arqueologicos",
  "turismo",
  "gastronomia",
  "atractivos",
  "naturales",
  "oportunidades",
  "educativo",
  "emprendedores",
  "generos",
  "juega",
  "narrativa",
  "emergentes",
  "buscar",
  "edicion",
  "multipuerto",
  "hello",
  "good",
  "morning",
  "how",
  "are",
  "you",
  "afternoon",
  "night",
  "how's",
  "everything",
  "what's",
  "up",
  "nice",
  "to",
  "okay",
  "new",
  "going",
  "today",
  "happening",
  "greetings",
  "see",
  "doing",
  "was",
  "your",
  "day",
  "life",
  "did",
  "it",
  "go",
  "there",
  "here",
  "feeling",
  "again",
  "hi",
  "later",
  "soon",
  "bye",
  "thanks",
  "help",
  "shall",
  "we",
  "talk",
  "until",
  "next",
  "time",
  "take",
  "care",
  "yourself",
  "thank",
  "god",
  "well",
  "i'm",
  "leaving",
  "can",
  "say",
  "goodbye",
  "pleasure",
  "another",
  "i",
  "have",
  "very",
  "much",
  "it's",
  "be",
  "friend",
  "now",
  "meeting",
  "i'll",
  "back",
  "being",
  "may",
  "around",
  "tomorrow",
  "off",
  "one",
  "want",
  "learn",
  "teach",
  "do",
  "make",
  "program",
  "show",
  "basic",
  "example",
  "add",
  "two",
  "numbers",
  "what",
  "loop",
  "explain",
  "function",
  "create",
  "file",
  "list",
  "handle",
  "errors",
  "libraries",
  "recommend",
  "library",
  "about",
  "an",
  "using",
  "started",
  "problem",
  "my",
  "write",
  "connect",
  "database",
  "applications",
  "nested",
  "interactive",
  "regular",
  "expressions",
  "graphics",
  "automate",
  "tasks",
  "used",
  "difficult",
  "language",
  "who",
  "created",
  "free",
  "module",
  "declare",
  "dictionary",
  "exceptions",
  "compiled",
  "or",
  "interpreted",
  "comment",
  "lines",
  "object",
  "package",
  "tuple",
  "run",
  "interpreter",
  "does",
  "support",
  "object-oriented",
  "programming",
  "comprehension",
  "iterator",
  "generator",
  "multiline",
  "indentation",
  "files",
  "languages",
  "​​exist",
  "need",
  "start",
  "algorithm",
  "syntax",
  "debugging",
  "mean",
  "conditional",
  "source",
  "functional",
  "linked",
  "compiler",
  "repository",
  "branch",
  "server",
  "unit",
  "test",
  "cycle",
  "neural",
  "network",
  "intelligence",
  "machine",
  "learning",
  "development",
  "environment",
  "supervised",
  "unsupervised",
  "reinforcement",
  "processing",
  "computer",
  "model",
  "assistant",
  "voice",
  "recognition",
  "sentiment",
  "analysis",
  "generative",
  "style",
  "transfer",
  "expert",
  "system",
  "robotics",
  "intelligent",
  "agent",
  "ethics",
  "training",
  "underestimation",
  "regression",
  "classification",
  "predictive",
  "analytics",
  "cognitive",
  "computing",
  "process",
  "automation",
  "mining",
  "strong",
  "weak",
  "cost",
  "algorithmic",
  "bias",
  "transparency",
  "ai",
  "pre-trained",
  "deep",
  "sequential",
  "hyperparameter",
  "distributed",
  "knowledge",
  "graph",
  "optical",
  "character",
  "swarm",
  "regularization",
  "real-time",
  "augmented",
  "synthetic",
  "dataset",
  "text",
  "doesn't",
  "work",
  "lists",
  "within",
  "access",
  "item",
  "stop",
  "parameter",
  "value",
  "from",
  "exception",
  "remove",
  "bookstores",
  "load",
  "into",
  "where",
  "located",
  "currency",
  "spoken",
  "national",
  "bird",
  "name",
  "cold",
  "cuts",
  "when",
  "guatemala's",
  "independence",
  "celebrated",
  "most",
  "famous",
  "archaeological",
  "site",
  "coffee",
  "corner",
  "holy",
  "week",
  "many",
  "departments",
  "ruins",
  "giant",
  "kites",
  "typical",
  "food",
  "monument",
  "guatemalan",
  "culture",
  "volcanoes",
  "cocoa",
  "mayans",
  "museum",
  "fabrics",
  "park",
  "flag",
  "represent",
  "flying",
  "stick",
  "carnival",
  "zone",
  "stuffed",
  "army",
  "river",
  "palace",
  "mayan",
  "calendar",
  "music",
  "dead",
  "kite",
  "tamale",
  "fair",
  "download",
  "should",
  "check",
  "installed",
  "on",
  "difference",
  "between",
  "tuples",
  "convert",
  "infinite",
  "optional",
  "parameters",
  "types",
  "key",
  "exists",
  "delete",
  "columns",
  "other",
  "besides",
  "dynamic",
  "routes",
  "save",
  "packages",
  "own",
  "call",
  "why",
  "slower",
  "than",
  "number",
  "versions",
  "sort",
  "duplicates",
  "dictionaries",
  "exist",
  "catch",
  "any",
  "column",
  "too",
  "large",
  "rows",
  "null",
  "values",
  "forms",
  "secure",
  "app",
  "change",
  "chart",
  "bar",
  "schedule",
  "repetitive",
  "automatically",
  "called",
  "climate",
  "hill",
  "dishes",
  "eaten",
  "theatre",
  "democracy",
  "market",
  "sports",
  "popular",
  "america",
  "near",
  "volcano",
  "important",
  "festivals",
  "tourist",
  "attractions",
  "georgian",
  "springs",
  "cicadas",
  "history",
  "cemetery",
  "extreme",
  "practiced",
  "universities",
  "all",
  "saints'",
  "importance",
  "activities",
  "indigenous",
  "groups",
  "live",
  "viewpoint",
  "drinks",
  "cathedral",
  "spirit",
  "traditional",
  "markets",
  "done",
  "church",
  "st",
  "nicholas",
  "crafts",
  "produced",
  "fruit",
  "broth",
  "religious",
  "role",
  "play",
  "education",
  "agricultural",
  "products",
  "game",
  "invented",
  "games",
  "best-selling",
  "console",
  "'esport'",
  "role-playing",
  "fighting",
  "strategy",
  "reality",
  "shooting",
  "simulation",
  "platform",
  "co-op",
  "mode",
  "action",
  "multiplayer",
  "racing",
  "survival",
  "main",
  "future",
  "historical",
  "terms",
  "xela's",
  "affect",
  "its",
  "agriculture",
  "events",
  "held",
  "makes",
  "unique",
  "which",
  "were",
  "inspired",
  "by",
  "mythology",
  "speedrun",
  "tabletop",
  "technology",
  "modern",
  "benefits",
  "impact",
  "industry",
  "best",
  "tourists",
  "gamification",
  "story",
  "made",
  "origin",
  "health",
  "sandbox",
  "played",
  "world",
  "developed",
  "user",
  "interface",
  "engine",
  "first",
  "horror",
  "adapter",
  "adapters",
  "power",
  "card",
  "know",
  "device",
  "voltage",
  "frequency",
  "port",
  "converter",
  "different",
  "phone",
  "wireless",
  "memory",
  "cards",
  "charge",
  "vehicle",
  "hearing",
  "aid",
  "projector",
  "technologies",
  "things",
  "cloud",
  "quantum",
  "cybersecurity",
  "mobile",
  "operating",
  "browser",
  "networks",
  "microprocessor",
  "cryptocurrencies",
  "applied",
  "portable",
  "search",
  "responsive",
  "design",
  "service",
  "systems",
  "engineering",
  "degree",
  "studied",
  "long",
  "last",
  "skills",
  "needed",
  "study",
  "engineer",
  "subjects",
  "companies",
  "​​are",
  "learned",
  "necessary",
  "mathematics",
  "science",
  "alone",
  "management",
  "agile",
  "field",
  "prototype",
  "requirements",
  "virtualization",
  "public",
  "business",
  "flowchart",
  "scratch",
  "give",
  "count",
  "words",
  "message",
  "condition",
  "arguments",
  "concatenate",
  "element",
  "read",
  "generate",
  "reverse",
  "times",
  "appears",
  "index",
  "recursive",
  "empty",
  "combine",
  "keys",
  "​​from",
  "elements",
  "contains",
  "find",
  "maximum",
  "minimum",
  "comprehensions",
  "size",
  "integer",
  "default",
  "argument",
  "inheritance",
  "select",
  "that",
  "calculates",
  "binary",
  "converts",
  "uppercase",
  "counts",
  "word",
  "second",
  "each",
  "sequence",
  "duplicate",
  "prime",
  "calculate",
  "greatest",
  "common",
  "(gcd)",
  "occurrences",
  "sum",
  "accept",
  "checks",
  "palindrome",
  "linear",
  "handles",
  "students",
  "sorts",
  "their",
  "length",
  "takes",
  "keyword",
  "specific",
  "removes",
  "smaller",
  "parts",
  "sorted",
  "returns",
  "non-null",
  "characters",
  "lowercase",
  "​​in",
  "email",
  "validation",
  "tell",
  "method",
  "command",
  "statement",
  "operator",
  "date",
  "allow",
  "operation",
  "perform",
  "achieve",
  "line",
  "send",
  "request",
  "build",
  "application",
  "graphs",
  "context",
  "manipulate",
  "dates",
  "opening",
  "custom",
  "pie",
  "promises",
  "event",
  "queries",
  "pattern",
  "microservices",
  "container",
  "queue",
  "relational",
  "migrations",
  "reactive",
  "balancer",
  "certificate",
  "monolithic",
  "architecture",
  "concurrency",
  "parallelization",
  "threads",
  "asynchronous",
  "tree",
  "parallel",
  "magic",
  "generating",
  "abstract",
  "properties",
  "implement",
  "metaclasses",
  "serialization",
  "static",
  "compare",
  "objects",
  "measure",
  "execution",
  "stack",
  "thread",
  "processes",
  "signal",
  "handler",
  "compressed",
  "contexts",
  "view",
  "commands",
  "limit",
  "usage",
  "immutable",
  "garbage",
  "collector",
  "disable",
  "compress",
  "manage",
  "cross-platform",
  "temporary",
  "instead",
  "methods",
  "useful",
  "prefer",
  "over",
  "reduce",
  "structures",
  "manually",
  "advantages",
  "offer",
  "creating",
  "handlers",
  "joins",
  "passing",
  "configurations",
  "avoid",
  "identifiers",
  "exact",
  "piece",
  "efficient",
  "caching",
  "generators",
  "clause",
  "without",
  "loading",
  "them",
  "completely",
  "decorators",
  "descending",
  "order",
  "largest",
  "zero",
  "comma",
  "separated",
  "only",
  "before",
  "ends",
  "intersection",
  "sets",
  "current",
  "even",
  "odd",
  "query",
  "something",
  "screen",
  "iterate",
  "through",
  "positive",
  "jump",
  "iteration",
  "greater",
  "goes",
  "divide",
  "remainder",
  "repeat",
  "consecutive",
  "constant",
  "wait",
  "few",
  "seconds",
  "comparison",
  "inside",
  "terminate",
  "multiply",
  "round",
  "hard",
  "drive",
  "motherboard",
  "sound",
  "peripherals",
  "keyboard",
  "printer",
  "64-bit",
  "address",
  "storage",
  "cooling",
  "connectivity",
  "external",
  "processor",
  "output",
  "technological",
  "communication",
  "embedded",
  "information",
  "content",
  "remote",
  "monitoring",
  "navigation",
  "payment",
  "desk",
  "recommendation",
  "instant",
  "messaging",
  "intrusion",
  "detection",
  "disaster",
  "protection",
  "backup",
  "traffic",
  "inventory",
  "identity",
  "verification",
  "giving",
  "​​can",
  "assign",
  "assigning",
  "initial",
  "happens",
  "incorrect",
  "out",
  "spaces",
  "names",
  "case",
  "sensitive",
  "rules",
  "naming",
  "interpolate",
  "boolean",
  "after",
  "i've",
  "try",
  "haven't",
  "defined",
  "reserved",
  "as",
  "declaring",
  "instance",
  "numeric",
  "end",
  "skip",
  "modified",
  "looping",
  "prints",
  "runs",
  "negative",
  "forget",
  "prevent",
  "printing",
  "true",
  "once",
  "related",
  "theory",
  "career",
  "computers",
  "terminates",
  "false",
  "counter",
  "step",
  "exit",
  "causing",
  "problems",
  "iterates",
  "at",
  "depends",
  "decrementing",
  "depend",
  "changes",
  "but",
  "found",
  "squares",
  "met",
  "topics",
  "cover",
  "this",
  "kind",
  "solve",
  "understand",
  "more",
  "structure",
  "ternary",
  "possible",
  "nest",
  "operators",
  "conditions",
  "equality",
  "based",
  "complex",
  "executes",
  "equal",
  "single",
  "options",
  "execute",
  "block",
  "less",
  "window",
  "extract",
  "page",
  "image",
  "executable",
  "questions",
  "projects",
  "could",
  "better",
  "concept",
  "ways",
  "helpful",
  "specifically",
  "am",
  "complicated",
  "concepts",
  "answer",
  "practical",
  "topic",
  "don't",
  "insert",
  "position",
  "arrangement",
  "arrays",
  "several",
  "cut",
  "outside",
  "two-dimensional",
  "group",
  "indexes",
  "backwards",
  "has",
  "relate",
  "same",
  "body",
  "amounts",
  "modify",
  "put",
  "executed",
  "starts",
  "encounters",
  "anything",
  "always",
  "compound",
  "stops",
  "increment",
  "prompt",
  "valid",
  "infinitely",
  "mistake",
  "logical",
  "calculations",
  "task",
  "places",
  "visiting",
  "algorithms",
  "expect",
  "develop",
  "components",
  "daily",
  "optimize",
  "performance",
  "essential",
  "project",
  "rapid",
  "characteristics",
  "place",
  "devices",
  "prepare",
  "job",
  "consider",
  "purchasing",
  "society",
  "centralized",
  "​​should",
  "influence",
  "economy",
  "engines",
  "beginners",
  "monitors",
  "tools",
  "images",
  "driving",
  "login",
  "revolutionizing",
  "healthcare",
  "choose",
  "techniques",
  "integrate",
  "existing",
  "improve",
  "energy",
  "efficiency",
  "building",
  "enterprise",
  "contribute",
  "ideal",
  "connecting",
  "older",
  "projectors",
  "challenges",
  "face",
  "analyzing",
  "high-level",
  "analyze",
  "steps",
  "follow",
  "ai-trained",
  "uses",
  "node",
  "labeled",
  "convolutional",
  "classified",
  "according",
  "trained",
  "connections",
  "train",
  "recurrent",
  "like",
  "render",
  "differences",
  "primary",
  "non-relational",
  "databases",
  "built",
  "centroid",
  "grouping",
  "optimized",
  "foreign",
  "fine-tune",
  "followed",
  "validate",
  "client-server",
  "visualize",
  "tables",
  "models",
  "cross",
  "scatter",
  "plot",
  "evaluation",
  "metric",
  "cross-validation",
  "logistic",
  "interpret",
  "heat",
  "box",
  "whisker",
  "sparsity",
  "matrix",
  "tune",
  "hyperparameters",
  "identify",
  "outliers",
  "metrics",
  "evaluate",
  "model's",
  "quartile",
  "square",
  "calculated",
  "coefficient",
  "determination",
  "positives",
  "negatives",
  "adjust",
  "threshold",
  "regularized",
  "accuracy",
  "stratified",
  "determine",
  "feature",
  "residual",
  "stacked",
  "curve",
  "traditions",
  "stand",
  "visit",
  "advanced",
  "recent",
  "years",
  "realistic",
  "available",
  "computer's",
  "gaming",
  "resources",
  "graphic",
  "services",
  "growing",
  "advances",
  "facilitate",
  "physical",
  "online",
  "platforms",
  "usually",
  "some",
  "examples",
  "factors",
  "choosing",
  "transforming",
  "educational",
  "specifications",
  "fairs",
  "quality",
  "measured",
  "space",
  "hackathons",
  "tech",
  "community",
  "resolution",
  "connection",
  "experience",
  "hackathon",
  "participate",
  "displays",
  "company",
  "innovation",
  "beyond",
  "collaboration",
  "notable",
  "productivity",
  "internationally",
  "recognized",
  "spanish",
  "destinations",
  "tourism",
  "gastronomy",
  "weather",
  "promoted",
  "opportunities",
  "entrepreneurs",
  "genres",
  "developing",
  "narrative",
  "emerging",
  "features",
  "look",
  "editing",
  "multiport"
]